/*
  #. [ 백준 2468_안전 영역 Silver I ]
  
  #. 문제
     재난방재청에서는 많은 비가 내리는 장마철에 대비해서 다음과 같은 일을 계획하고 있다. 먼저 어떤 지역의 높이 정보를 파악한다. 
	 그 다음에 그 지역에 많은 비가 내렸을 때 물에 잠기지 않는 안전한 영역이 최대로 몇 개가 만들어 지는 지를 조사하려고 한다. 
	 이때, 문제를 간단하게 하기 위하여, 장마철에 내리는 비의 양에 따라 일정한 높이 이하의 모든 지점은 물에 잠긴다고 가정한다.
	 
	 어떤 지역의 높이 정보는 행과 열의 크기가 각각 N인 2차원 배열 형태로 주어지며 배열의 각 원소는 해당 지점의 높이를 표시하는 자연수이다. 
	 예를 들어, 다음은 N=5인 지역의 높이 정보이다.
	 
	 
	 이제 위와 같은 지역에 많은 비가 내려서 높이가 4 이하인 모든 지점이 물에 잠겼다고 하자. 
	 이 경우에 물에 잠기는 지점을 회색으로 표시하면 다음과 같다. 
	 물에 잠기지 않는 안전한 영역이라 함은 물에 잠기지 않는 지점들이 위, 아래, 오른쪽 혹은 왼쪽으로 인접해 있으며 그 크기가 최대인 영역을 말한다. 
	 위의 경우에서 물에 잠기지 않는 안전한 영역은 5개가 된다(꼭짓점으로만 붙어 있는 두 지점은 인접하지 않는다고 취급한다). 
	 
	 또한 위와 같은 지역에서 높이가 6이하인 지점을 모두 잠기게 만드는 많은 비가 내리면 물에 잠기지 않는 안전한 영역은 
	 아래 그림에서와 같이 네 개가 됨을 확인할 수 있다. 
	 
	 이와 같이 장마철에 내리는 비의 양에 따라서 물에 잠기지 않는 안전한 영역의 개수는 다르게 된다. 
	 위의 예와 같은 지역에서 내리는 비의 양에 따른 모든 경우를 다 조사해 보면 물에 잠기지 않는 안전한 영역의 개수 중에서 최대인 경우는 5임을 알 수 있다. 
	 
	 어떤 지역의 높이 정보가 주어졌을 때, 장마철에 물에 잠기지 않는 안전한 영역의 최대 개수를 계산하는 프로그램을 작성하시오. 

  #. 입력
     - 첫째 줄에는 어떤 지역을 나타내는 2차원 배열의 행과 열의 개수를 나타내는 수 N이 입력된다. 
	 - N은 2 이상 100 이하의 정수이다. 
	 - 둘째 줄부터 N개의 각 줄에는 2차원 배열의 첫 번째 행부터 N번째 행까지 순서대로 한 행씩 높이 정보가 입력된다. 
	 - 각 줄에는 각 행의 첫 번째 열부터 N번째 열까지 N개의 높이 정보를 나타내는 자연수가 빈 칸을 사이에 두고 입력된다. 높이는 1이상 100 이하의 정수이다.

  #. 출력
     첫째 줄에 장마철에 물에 잠기지 않는 안전한 영역의 최대 개수를 출력한다.

  #. 예제 입력 1 
     5
	 6 8 2 6 2
	 3 2 3 4 6
	 6 7 3 3 2
	 7 2 5 3 6
	 8 9 5 2 7
  #. 예제 출력 1 
     5

  #. 노트
     아무 지역도 물에 잠기지 않을 수도 있다.
*/

/*
  #. 나의 풀이법.
     - '노트'의 경우를 고려하지 않아 틀렸다. 모든 지역의 높이가 1인경우, 안전지역의 개수는 0이 아니라
	    1로 시작한다. 사실 지금도 이해가지 않음...
		최소 경우의 수가 1이라고 생각함.
	 - 간단한 BFS문제이다.
	 - 높이의 범위가 <= 100이지만, 행렬에 입력한 값의 최댓값(최대 높이)까지만 구한다.

	 - 1 ~ 최댓값 까지 height에 따라 BFS를 수행하면서 안전영역의 개수를 구하고,
	   이 중 최댓값이 정답이 된다.
*/

#include <iostream>
#include <queue>
using namespace std;

int n;
int map[100][100];
int check[100][100];

int di[4] = { -1, 0, 1, 0 };
int dj[4] = { 0, -1, 0, 1 };

void bfs(int height, int i, int j)
{
	queue<pair<int, int>> q;

	q.push(make_pair(i, j));
	check[i][j] = true;

	while (!q.empty())
	{
		//
		pair<int, int> curr = q.front();
		q.pop();

		for (int k = 0; k < 4; k++)
		{
			int next_i = curr.first + di[k];
			int next_j = curr.second + dj[k];
			//해당 크기 범위안에 존재하고,
			if (next_i >= 0 && next_i < n && next_j >= 0 && next_j < n)
			{
				//탐색 할 위치가 물에 잠기지 않은 위치이며, 아직 방문하지 않은 곳이면
				if (map[next_i][next_j] > height && check[next_i][next_j] == false)
				{
					//방문처리 후, 큐에 삽입.
					check[next_i][next_j] = true;
					q.push(make_pair(next_i, next_j));
				}
			}
		}
	}
}

int main()
{
	cin >> n;

	//0. 최소 경우의 수는 1
	int answer = 1;
	//1. 행렬에 입력한 값들 중 최대 높이를 찾는다.
	int max = 0;
	
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cin >> map[i][j];
			if (max < map[i][j])
				max = map[i][j];
		}
	}

	//2. 1부터 최대 높이인 max까지만 구한다. max이후 부터는 안전영역의 개수는 모두 0이다.
	//   heigh에 따라 BFS를 수행한다.
	for (int h = 1; h <= max; h++)
	{
		int height = h;
		int safety_zone = 0;
	
		for (int i = 0; i < n; i++)
		{
			for (int j = 0; j < n; j++)
			{
				//2.1 height보다 커야 물에 잠기지 않는다.
				if (map[i][j] > height && check[i][j] == false)
				{
					bfs(height, i, j);
					safety_zone++;
				}
			}
		}
		//2.2 방문표시 행렬 초기화
		memset(check, false, sizeof(check));
		if (answer < safety_zone)
			answer = safety_zone;
	}

	cout << answer << "\n";

	return 0;
}